import numpy as np

a = np.array([
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, -0.8333333333333334, 3.0, 0.0, -1.5, 0.0, 0.3333333333333333, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, -0.8333333333333334, 0.0, 3.0, 0.0, -1.5, 0.0, 0.0, 0.0, 0.3333333333333333,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.3333333333333333, -1.5, 0.0, 3.0, 0.0, -0.8333333333333334, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.4390243902439024, 0.0, 0.0, 0.6585365853658537, 0.6585365853658537, 0.0, 0.0,
    0.6585365853658537, 0.8780487804878049, 0.6585365853658537, 0.0, 0.0, 0.4390243902439024, 0.6585365853658537,
    0.6585365853658537, 0.4390243902439024, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.2784552845528455,
    -0.9969512195121951, -0.9969512195121951, -0.9969512195121951, -0.9969512195121951, 0.2784552845528455,
    -0.9969512195121951, -0.9969512195121951, 0.2784552845528455,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.3333333333333333, 0.0, -1.5, 0.0, 3.0, 0.0, 0.0, 0.0, -0.8333333333333334,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, -0.8333333333333334, 3.0, -1.5, 0.3333333333333333,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.3333333333333333, -1.5, 3.0, -0.8333333333333334,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0,
    0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0]).reshape((10, 37))
# for i in a:
#     print(i)

aux = [0, 3, 5, 10, 14, 21, 23, 25, 27]
for i in range(9):
    a[:, aux[i]] += a[:, 28 + i]

# for j in range(28):
#     print('%16.7f' % j, end=', ')

aux2 = []
for i in range(28):
    if all(a[:, i] == 0):
        aux2.append(i)
print(aux2)

for i, aa in enumerate(a):
    for jj, j in enumerate(aa[:28]):
        if jj in aux2:
            continue
        print('%16.7f' % j, end=', ')
    print()





print('begin cui time----------------------------')

data = """载入	301	CPU : 读入obj
载入	177	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	102	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4780	CPU : 分割多边形
载入	212	CPU : 多边形三角化
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
载入	300	CPU : 读入obj
载入	180	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	102	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4777	CPU : 分割多边形
载入	214	CPU : 多边形三角化
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
载入	319	CPU : 读入obj
载入	378	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	111	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4890	CPU : 分割多边形
载入	211	CPU : 多边形三角化
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
载入	310	CPU : 读入obj
载入	181	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	2	GPU : 复制节点向量和控制顶点到显存
载入	102	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4792	CPU : 分割多边形
载入	214	CPU : 多边形三角化
载入	23	GPU : 将三角形列表信息载入显存
载入	2	GPU : 生成UVW矩阵
载入	299	CPU : 读入obj
载入	179	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	2	GPU : 复制节点向量和控制顶点到显存
载入	101	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4772	CPU : 分割多边形
载入	214	CPU : 多边形三角化
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
载入	300	CPU : 读入obj
载入	179	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	101	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4757	CPU : 分割多边形
载入	212	CPU : 多边形三角化
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
载入	302	CPU : 读入obj
载入	180	CPU : 清理内存
载入	1	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	102	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4778	CPU : 分割多边形
载入	222	CPU : 多边形三角化
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
载入	317	CPU : 读入obj
载入	181	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	102	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4786	CPU : 分割多边形
载入	214	CPU : 多边形三角化
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
载入	310	CPU : 读入obj
载入	180	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	2	GPU : 复制节点向量和控制顶点到显存
载入	101	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4797	CPU : 分割多边形
载入	213	CPU : 多边形三角化
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
载入	302	CPU : 读入obj
载入	179	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	2	GPU : 复制节点向量和控制顶点到显存
载入	102	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4781	CPU : 分割多边形
载入	214	CPU : 多边形三角化
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵"""

lines = data.split('\n')
time = [0] * 9
for i, l in enumerate(lines):
    t = l.split()
    time[i % 9] += int(t[1])

# for i in range(9):
#     time[i] /= 10
#     split = lines[i].split()
#     split[1] = str(time[i])
#     print(' '.join(split))


data3 = """mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	303	CPU : 读入obj
载入	178	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	2	GPU : 复制节点向量和控制顶点到显存
载入	104	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4777	CPU : 分割多边形
载入	214	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	303	CPU : 读入obj
载入	179	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	102	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4769	CPU : 分割多边形
载入	211	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	300	CPU : 读入obj
载入	179	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	103	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4736	CPU : 分割多边形
载入	211	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	303	CPU : 读入obj
载入	179	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	2	GPU : 复制节点向量和控制顶点到显存
载入	103	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4759	CPU : 分割多边形
载入	216	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	303	CPU : 读入obj
载入	179	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	104	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4767	CPU : 分割多边形
载入	215	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	306	CPU : 读入obj
载入	181	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	102	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4770	CPU : 分割多边形
载入	214	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	302	CPU : 读入obj
载入	183	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	104	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4744	CPU : 分割多边形
载入	216	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	302	CPU : 读入obj
载入	178	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	103	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4778	CPU : 分割多边形
载入	213	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	304	CPU : 读入obj
载入	181	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	106	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4767	CPU : 分割多边形
载入	214	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	306	CPU : 读入obj
载入	184	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	103	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4742	CPU : 分割多边形
载入	216	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	302	CPU : 读入obj
载入	178	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	102	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4786	CPU : 分割多边形
载入	216	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	303	CPU : 读入obj
载入	178	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	101	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4767	CPU : 分割多边形
载入	214	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	24	GPU : 将三角形列表信息载入显存
载入	0	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	303	CPU : 读入obj
载入	181	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	2	GPU : 复制节点向量和控制顶点到显存
载入	103	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4780	CPU : 分割多边形
载入	221	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	303	CPU : 读入obj
载入	182	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	2	GPU : 复制节点向量和控制顶点到显存
载入	103	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4759	CPU : 分割多边形
载入	216	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	304	CPU : 读入obj
载入	173	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	9	GPU : 复制节点向量和控制顶点到显存
载入	103	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4750	CPU : 分割多边形
载入	218	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	25	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	302	CPU : 读入obj
载入	178	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	103	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4769	CPU : 分割多边形
载入	216	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	306	CPU : 读入obj
载入	181	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	2	GPU : 复制节点向量和控制顶点到显存
载入	104	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4740	CPU : 分割多边形
载入	219	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	176	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	306	CPU : 读入obj
载入	182	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	103	GPU : 按照PN-Triangle方法计算原始面片的控制顶点
载入	4777	CPU : 分割多边形
载入	214	CPU : 多边形三角化
triangleNum = 53180
degree = 6, degree_lower = 3, constrait_point_num = 9
triangleCtrlPointNum = 28, triangleCtrlPointNum_lower = 10
activeThreadNumStep1 = 478620, blockNumStep1 = 3740
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
mtlRangeListSize = 2579
x = (-3685.19, 3685.19)
y = (-0.00011, 3847.14)
z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, minx = -1, maxx = 1
===================================================
载入	303	CPU : 读入OBJ
载入	184	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	103	GPU : 按照PN-TRIANGLE方法计算原始面片的控制顶点
载入	4752	CPU : 分割多边形
载入	448	CPU : 多边形三角化
TRIANGLENUM = 53180
DEGREE = 6, DEGREE_LOWER = 3, CONSTRAIT_POINT_NUM = 9
TRIANGLECTRLPOINTNUM = 28, TRIANGLECTRLPOINTNUM_LOWER = 10
ACTIVETHREADNUMSTEP1 = 478620, BLOCKNUMSTEP1 = 3740
载入	176	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
MTLRANGELISTSIZE = 2579
X = (-3685.19, 3685.19)
Y = (-0.00011, 3847.14)
Z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, MINX = -1, MAXX = 1
===================================================
载入	313	CPU : 读入OBJ
载入	207	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	137	GPU : 按照PN-TRIANGLE方法计算原始面片的控制顶点
载入	4775	CPU : 分割多边形
载入	216	CPU : 多边形三角化
TRIANGLENUM = 53180
DEGREE = 6, DEGREE_LOWER = 3, CONSTRAIT_POINT_NUM = 9
TRIANGLECTRLPOINTNUM = 28, TRIANGLECTRLPOINTNUM_LOWER = 10
ACTIVETHREADNUMSTEP1 = 478620, BLOCKNUMSTEP1 = 3740
载入	24	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
MTLRANGELISTSIZE = 2579
X = (-3685.19, 3685.19)
Y = (-0.00011, 3847.14)
Z = (-1484.23, 1484.23)
原始模型共46742个面片, 23452个顶点, MINX = -1, MAXX = 1
===================================================
载入	304	CPU : 读入OBJ
载入	183	CPU : 清理内存
载入	0	CPU : 计算节点向量和控制顶点
载入	1	GPU : 复制节点向量和控制顶点到显存
载入	104	GPU : 按照PN-TRIANGLE方法计算原始面片的控制顶点
载入	4748	CPU : 分割多边形
载入	216	CPU : 多边形三角化
TRIANGLENUM = 53180
DEGREE = 6, DEGREE_LOWER = 3, CONSTRAIT_POINT_NUM = 9
TRIANGLECTRLPOINTNUM = 28, TRIANGLECTRLPOINTNUM_LOWER = 10
ACTIVETHREADNUMSTEP1 = 478620, BLOCKNUMSTEP1 = 3740
载入	23	GPU : 将三角形列表信息载入显存
载入	1	GPU : 生成UVW矩阵
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&"""

data2 = []
for l in zip(*[iter(data3.split('\n'))] * 20):
    # print(l)
    data2.append(list(l[6:13]) + list(l[17:19]))
res = [0] * (len(data2[0]))
for l in data2:
    # print(l)
    for i, s in enumerate(l):
        # print(i, s)
        tokens = s.split()
        res[i] += int(tokens[1])

for i, t in enumerate(res):
    tokens = data2[0][i].split()
    tokens[1] = str((t + time[i]) / (len(data2) + 10))
    print(' '.join(tokens))

data = """===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	1	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	1	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	33	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	32	GPU : 计算三角化点的值

"""

data = """===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	1	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	1	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	1	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	6	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	42	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	1	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	20	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

===================================================

改变	0	CPU : 改变控制顶点
改变	**** GPU ****
改变	0	GPU : 将新的控制顶点传入显存
改变	43	GPU : 计算 Bezier 曲面片采样点的值
改变	21	GPU : 计算三角Bezier曲面片控制顶点
改变	5	GPU : 计算三角化点的值

"""
data = """改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   38.2060	GPU : 计算Bezier曲面片采样点的值
改变	   13.6070	GPU : 计算Bezier曲面片采样点的值
改变	   14.0790	GPU : 计算控制顶点
改变	    5.2250	GPU : 计算normal
改变	    3.7610	GPU : 调整控制顶点
改变	    5.0180	GPU : tess
改变	    0.0400	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   36.5030	GPU : 计算Bezier曲面片采样点的值
改变	   12.3260	GPU : 计算Bezier曲面片采样点的值
改变	   12.6250	GPU : 计算控制顶点
改变	    4.7560	GPU : 计算normal
改变	    4.0080	GPU : 调整控制顶点
改变	    4.5760	GPU : tess
改变	    0.0560	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   34.5880	GPU : 计算Bezier曲面片采样点的值
改变	   12.3250	GPU : 计算Bezier曲面片采样点的值
改变	   12.7010	GPU : 计算控制顶点
改变	    4.7500	GPU : 计算normal
改变	    3.9970	GPU : 调整控制顶点
改变	    4.5690	GPU : tess
改变	    0.0440	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   32.9630	GPU : 计算Bezier曲面片采样点的值
改变	   11.3010	GPU : 计算Bezier曲面片采样点的值
改变	   11.4680	GPU : 计算控制顶点
改变	    4.3710	GPU : 计算normal
改变	    4.6810	GPU : 调整控制顶点
改变	    4.2150	GPU : tess
改变	    0.0430	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5850	GPU : 计算Bezier曲面片采样点的值
改变	   11.2930	GPU : 计算Bezier曲面片采样点的值
改变	   11.5620	GPU : 计算控制顶点
改变	    4.3810	GPU : 计算normal
改变	    4.7240	GPU : 调整控制顶点
改变	    4.2120	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6160	GPU : 计算Bezier曲面片采样点的值
改变	   11.2800	GPU : 计算Bezier曲面片采样点的值
改变	   11.4980	GPU : 计算控制顶点
改变	    4.3700	GPU : 计算normal
改变	    4.6560	GPU : 调整控制顶点
改变	    4.2090	GPU : tess
改变	    0.0610	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.5830	GPU : 计算Bezier曲面片采样点的值
改变	   11.2900	GPU : 计算Bezier曲面片采样点的值
改变	   11.5830	GPU : 计算控制顶点
改变	    4.3650	GPU : 计算normal
改变	    4.6480	GPU : 调整控制顶点
改变	    4.2270	GPU : tess
改变	    0.0590	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6140	GPU : 计算Bezier曲面片采样点的值
改变	   11.2870	GPU : 计算Bezier曲面片采样点的值
改变	   11.5690	GPU : 计算控制顶点
改变	    4.3730	GPU : 计算normal
改变	    4.6280	GPU : 调整控制顶点
改变	    4.2000	GPU : tess
改变	    0.0430	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6400	GPU : 计算Bezier曲面片采样点的值
改变	   11.2840	GPU : 计算Bezier曲面片采样点的值
改变	   11.4860	GPU : 计算控制顶点
改变	    4.3760	GPU : 计算normal
改变	    4.6920	GPU : 调整控制顶点
改变	    4.2250	GPU : tess
改变	    0.0370	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6130	GPU : 计算Bezier曲面片采样点的值
改变	   11.2870	GPU : 计算Bezier曲面片采样点的值
改变	   11.5120	GPU : 计算控制顶点
改变	    4.3690	GPU : 计算normal
改变	    4.6920	GPU : 调整控制顶点
改变	    4.2010	GPU : tess
改变	    0.0390	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6230	GPU : 计算Bezier曲面片采样点的值
改变	 -987.7240	GPU : 计算Bezier曲面片采样点的值
改变	   11.5970	GPU : 计算控制顶点
改变	    4.3720	GPU : 计算normal
改变	    4.5640	GPU : 调整控制顶点
改变	    4.2250	GPU : tess
改变	    0.0570	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6040	GPU : 计算Bezier曲面片采样点的值
改变	   11.2900	GPU : 计算Bezier曲面片采样点的值
改变	   11.4730	GPU : 计算控制顶点
改变	    4.3680	GPU : 计算normal
改变	    4.6800	GPU : 调整控制顶点
改变	    4.2080	GPU : tess
改变	    0.0430	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6000	GPU : 计算Bezier曲面片采样点的值
改变	   11.2810	GPU : 计算Bezier曲面片采样点的值
改变	   11.6180	GPU : 计算控制顶点
改变	    4.3630	GPU : 计算normal
改变	    4.5490	GPU : 调整控制顶点
改变	    4.2050	GPU : tess
改变	    0.0340	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6230	GPU : 计算Bezier曲面片采样点的值
改变	   11.2720	GPU : 计算Bezier曲面片采样点的值
改变	   11.4420	GPU : 计算控制顶点
改变	    4.3750	GPU : 计算normal
改变	    4.5960	GPU : 调整控制顶点
改变	    4.2020	GPU : tess
改变	    0.0250	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5790	GPU : 计算Bezier曲面片采样点的值
改变	   11.2940	GPU : 计算Bezier曲面片采样点的值
改变	   11.6150	GPU : 计算控制顶点
改变	    4.3760	GPU : 计算normal
改变	    4.6900	GPU : 调整控制顶点
改变	    4.2090	GPU : tess
改变	    0.0480	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5920	GPU : 计算Bezier曲面片采样点的值
改变	   11.2830	GPU : 计算Bezier曲面片采样点的值
改变	   11.5650	GPU : 计算控制顶点
改变	    4.3630	GPU : 计算normal
改变	    4.6550	GPU : 调整控制顶点
改变	    4.2150	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6120	GPU : 计算Bezier曲面片采样点的值
改变	   11.2700	GPU : 计算Bezier曲面片采样点的值
改变	   11.5000	GPU : 计算控制顶点
改变	    4.3760	GPU : 计算normal
改变	    4.6950	GPU : 调整控制顶点
改变	    4.2150	GPU : tess
改变	    0.0460	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5760	GPU : 计算Bezier曲面片采样点的值
改变	   11.2850	GPU : 计算Bezier曲面片采样点的值
改变	   11.4600	GPU : 计算控制顶点
改变	    4.3690	GPU : 计算normal
改变	    4.7470	GPU : 调整控制顶点
改变	    4.2220	GPU : tess
改变	    0.0410	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5750	GPU : 计算Bezier曲面片采样点的值
改变	   11.2680	GPU : 计算Bezier曲面片采样点的值
改变	   11.5790	GPU : 计算控制顶点
改变	    4.3710	GPU : 计算normal
改变	    4.6840	GPU : 调整控制顶点
改变	    4.2080	GPU : tess
改变	    0.0640	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.5810	GPU : 计算Bezier曲面片采样点的值
改变	   11.2720	GPU : 计算Bezier曲面片采样点的值
改变	   11.5200	GPU : 计算控制顶点
改变	    4.3650	GPU : 计算normal
改变	    4.6210	GPU : 调整控制顶点
改变	    4.2300	GPU : tess
改变	    0.0220	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5930	GPU : 计算Bezier曲面片采样点的值
改变	   11.2910	GPU : 计算Bezier曲面片采样点的值
改变	   11.5130	GPU : 计算控制顶点
改变	    4.3600	GPU : 计算normal
改变	    4.5980	GPU : 调整控制顶点
改变	    4.1910	GPU : tess
改变	    0.0550	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5800	GPU : 计算Bezier曲面片采样点的值
改变	   11.2800	GPU : 计算Bezier曲面片采样点的值
改变	   11.5580	GPU : 计算控制顶点
改变	    4.3720	GPU : 计算normal
改变	    4.4740	GPU : 调整控制顶点
改变	    4.2270	GPU : tess
改变	    0.0570	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6140	GPU : 计算Bezier曲面片采样点的值
改变	   11.3000	GPU : 计算Bezier曲面片采样点的值
改变	   11.6850	GPU : 计算控制顶点
改变	    4.3770	GPU : 计算normal
改变	    4.5220	GPU : 调整控制顶点
改变	    4.2360	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	 -967.4130	GPU : 计算Bezier曲面片采样点的值
改变	   11.3000	GPU : 计算Bezier曲面片采样点的值
改变	   11.5020	GPU : 计算控制顶点
改变	    4.3700	GPU : 计算normal
改变	    4.7570	GPU : 调整控制顶点
改变	    4.2340	GPU : tess
改变	    0.0390	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5980	GPU : 计算Bezier曲面片采样点的值
改变	   11.2840	GPU : 计算Bezier曲面片采样点的值
改变	   11.4880	GPU : 计算控制顶点
改变	    4.3850	GPU : 计算normal
改变	    4.6330	GPU : 调整控制顶点
改变	    4.1830	GPU : tess
改变	    0.0430	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6030	GPU : 计算Bezier曲面片采样点的值
改变	   11.3000	GPU : 计算Bezier曲面片采样点的值
改变	   11.4900	GPU : 计算控制顶点
改变	    4.3750	GPU : 计算normal
改变	    4.6810	GPU : 调整控制顶点
改变	    4.2080	GPU : tess
改变	    0.0530	GPU : copy
改变	1	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5670	GPU : 计算Bezier曲面片采样点的值
改变	   11.2700	GPU : 计算Bezier曲面片采样点的值
改变	   11.5900	GPU : 计算控制顶点
改变	    4.3740	GPU : 计算normal
改变	    4.5250	GPU : 调整控制顶点
改变	    4.2240	GPU : tess
改变	    0.0480	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6330	GPU : 计算Bezier曲面片采样点的值
改变	   11.3050	GPU : 计算Bezier曲面片采样点的值
改变	   11.4740	GPU : 计算控制顶点
改变	    4.3670	GPU : 计算normal
改变	    4.6530	GPU : 调整控制顶点
改变	    4.2050	GPU : tess
改变	    0.0410	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5740	GPU : 计算Bezier曲面片采样点的值
改变	   11.2750	GPU : 计算Bezier曲面片采样点的值
改变	   11.6110	GPU : 计算控制顶点
改变	    4.3780	GPU : 计算normal
改变	    4.6930	GPU : 调整控制顶点
改变	    4.2150	GPU : tess
改变	    0.0440	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   38.2130	GPU : 计算Bezier曲面片采样点的值
改变	   13.5990	GPU : 计算Bezier曲面片采样点的值
改变	   14.0170	GPU : 计算控制顶点
改变	    5.2210	GPU : 计算normal
改变	    3.6570	GPU : 调整控制顶点
改变	    5.0420	GPU : tess
改变	    0.0500	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   35.8950	GPU : 计算Bezier曲面片采样点的值
改变	   12.3390	GPU : 计算Bezier曲面片采样点的值
改变	   12.6780	GPU : 计算控制顶点
改变	    4.7490	GPU : 计算normal
改变	    4.2450	GPU : 调整控制顶点
改变	    4.5970	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   34.6120	GPU : 计算Bezier曲面片采样点的值
改变	   12.3410	GPU : 计算Bezier曲面片采样点的值
改变	   12.6130	GPU : 计算控制顶点
改变	    4.7650	GPU : 计算normal
改变	    4.0810	GPU : 调整控制顶点
改变	    4.5740	GPU : tess
改变	    0.0590	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   32.3950	GPU : 计算Bezier曲面片采样点的值
改变	   11.2940	GPU : 计算Bezier曲面片采样点的值
改变	   11.3840	GPU : 计算控制顶点
改变	    4.3750	GPU : 计算normal
改变	    4.6040	GPU : 调整控制顶点
改变	    4.2180	GPU : tess
改变	    0.0580	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6080	GPU : 计算Bezier曲面片采样点的值
改变	   11.2820	GPU : 计算Bezier曲面片采样点的值
改变	   11.6050	GPU : 计算控制顶点
改变	    4.3710	GPU : 计算normal
改变	    4.7490	GPU : 调整控制顶点
改变	    4.2070	GPU : tess
改变	    0.0330	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5850	GPU : 计算Bezier曲面片采样点的值
改变	   11.2810	GPU : 计算Bezier曲面片采样点的值
改变	   11.5220	GPU : 计算控制顶点
改变	    4.3750	GPU : 计算normal
改变	    4.6330	GPU : 调整控制顶点
改变	    4.2020	GPU : tess
改变	    0.0370	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6020	GPU : 计算Bezier曲面片采样点的值
改变	   11.2800	GPU : 计算Bezier曲面片采样点的值
改变	   11.6030	GPU : 计算控制顶点
改变	    4.3710	GPU : 计算normal
改变	    4.5990	GPU : 调整控制顶点
改变	    4.2220	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5610	GPU : 计算Bezier曲面片采样点的值
改变	   11.2720	GPU : 计算Bezier曲面片采样点的值
改变	   11.5450	GPU : 计算控制顶点
改变	    4.3710	GPU : 计算normal
改变	    4.8080	GPU : 调整控制顶点
改变	    4.2070	GPU : tess
改变	    0.0560	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6060	GPU : 计算Bezier曲面片采样点的值
改变	   11.3020	GPU : 计算Bezier曲面片采样点的值
改变	   11.5280	GPU : 计算控制顶点
改变	    4.3750	GPU : 计算normal
改变	    4.6230	GPU : 调整控制顶点
改变	    4.2240	GPU : tess
改变	    0.0580	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5900	GPU : 计算Bezier曲面片采样点的值
改变	   11.2770	GPU : 计算Bezier曲面片采样点的值
改变	   11.6630	GPU : 计算控制顶点
改变	    4.3710	GPU : 计算normal
改变	    4.7110	GPU : 调整控制顶点
改变	    4.2170	GPU : tess
改变	    0.0450	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6060	GPU : 计算Bezier曲面片采样点的值
改变	   11.2920	GPU : 计算Bezier曲面片采样点的值
改变	   11.5740	GPU : 计算控制顶点
改变	    4.3730	GPU : 计算normal
改变	    4.6440	GPU : 调整控制顶点
改变	    4.1960	GPU : tess
改变	    0.0330	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5760	GPU : 计算Bezier曲面片采样点的值
改变	   11.3000	GPU : 计算Bezier曲面片采样点的值
改变	   11.5920	GPU : 计算控制顶点
改变	    4.3660	GPU : 计算normal
改变	    4.6370	GPU : 调整控制顶点
改变	    4.2360	GPU : tess
改变	    0.0610	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	 -967.4230	GPU : 计算Bezier曲面片采样点的值
改变	   11.2850	GPU : 计算Bezier曲面片采样点的值
改变	   11.6010	GPU : 计算控制顶点
改变	    4.3670	GPU : 计算normal
改变	    4.7680	GPU : 调整控制顶点
改变	    4.2260	GPU : tess
改变	    0.0420	GPU : copy
改变	1	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5930	GPU : 计算Bezier曲面片采样点的值
改变	   11.2800	GPU : 计算Bezier曲面片采样点的值
改变	   11.4820	GPU : 计算控制顶点
改变	    4.3680	GPU : 计算normal
改变	    4.6030	GPU : 调整控制顶点
改变	    4.2260	GPU : tess
改变	    0.0610	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6320	GPU : 计算Bezier曲面片采样点的值
改变	   11.2820	GPU : 计算Bezier曲面片采样点的值
改变	   11.4420	GPU : 计算控制顶点
改变	    4.3630	GPU : 计算normal
改变	    4.7070	GPU : 调整控制顶点
改变	    4.2190	GPU : tess
改变	    0.0620	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5780	GPU : 计算Bezier曲面片采样点的值
改变	   11.2820	GPU : 计算Bezier曲面片采样点的值
改变	   11.5460	GPU : 计算控制顶点
改变	    4.3810	GPU : 计算normal
改变	    4.7310	GPU : 调整控制顶点
改变	    4.2270	GPU : tess
改变	    0.0580	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6120	GPU : 计算Bezier曲面片采样点的值
改变	   11.2850	GPU : 计算Bezier曲面片采样点的值
改变	   11.4680	GPU : 计算控制顶点
改变	    4.3680	GPU : 计算normal
改变	    4.5630	GPU : 调整控制顶点
改变	    4.2160	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6110	GPU : 计算Bezier曲面片采样点的值
改变	   11.2840	GPU : 计算Bezier曲面片采样点的值
改变	   11.4770	GPU : 计算控制顶点
改变	    4.3740	GPU : 计算normal
改变	    4.7320	GPU : 调整控制顶点
改变	    4.2120	GPU : tess
改变	    0.0570	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6290	GPU : 计算Bezier曲面片采样点的值
改变	   11.2860	GPU : 计算Bezier曲面片采样点的值
改变	   11.5170	GPU : 计算控制顶点
改变	    4.3670	GPU : 计算normal
改变	    4.6650	GPU : 调整控制顶点
改变	    4.2160	GPU : tess
改变	    0.0580	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5910	GPU : 计算Bezier曲面片采样点的值
改变	   11.2810	GPU : 计算Bezier曲面片采样点的值
改变	   11.6790	GPU : 计算控制顶点
改变	    4.3700	GPU : 计算normal
改变	    4.5720	GPU : 调整控制顶点
改变	    4.2050	GPU : tess
改变	    0.0540	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.5590	GPU : 计算Bezier曲面片采样点的值
改变	   11.2860	GPU : 计算Bezier曲面片采样点的值
改变	   11.4900	GPU : 计算控制顶点
改变	    4.3740	GPU : 计算normal
改变	    4.7320	GPU : 调整控制顶点
改变	    4.2260	GPU : tess
改变	    0.0570	GPU : copy
改变	1	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5970	GPU : 计算Bezier曲面片采样点的值
改变	   11.2760	GPU : 计算Bezier曲面片采样点的值
改变	   11.5500	GPU : 计算控制顶点
改变	    4.3760	GPU : 计算normal
改变	    4.6290	GPU : 调整控制顶点
改变	    4.2210	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5910	GPU : 计算Bezier曲面片采样点的值
改变	   11.2800	GPU : 计算Bezier曲面片采样点的值
改变	   11.6210	GPU : 计算控制顶点
改变	    4.3790	GPU : 计算normal
改变	    4.6470	GPU : 调整控制顶点
改变	    4.2270	GPU : tess
改变	    0.0560	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6270	GPU : 计算Bezier曲面片采样点的值
改变	   11.2770	GPU : 计算Bezier曲面片采样点的值
改变	   11.5550	GPU : 计算控制顶点
改变	    4.3650	GPU : 计算normal
改变	    4.6300	GPU : 调整控制顶点
改变	    4.2280	GPU : tess
改变	    0.0570	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6120	GPU : 计算Bezier曲面片采样点的值
改变	   11.2800	GPU : 计算Bezier曲面片采样点的值
改变	   11.5520	GPU : 计算控制顶点
改变	    4.3770	GPU : 计算normal
改变	    4.7090	GPU : 调整控制顶点
改变	    4.2120	GPU : tess
改变	    0.0560	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	 -967.4040	GPU : 计算Bezier曲面片采样点的值
改变	   11.3010	GPU : 计算Bezier曲面片采样点的值
改变	   11.5660	GPU : 计算控制顶点
改变	    4.3800	GPU : 计算normal
改变	    4.7020	GPU : 调整控制顶点
改变	    4.2330	GPU : tess
改变	    0.0610	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6210	GPU : 计算Bezier曲面片采样点的值
改变	   11.2780	GPU : 计算Bezier曲面片采样点的值
改变	   11.6100	GPU : 计算控制顶点
改变	    4.3650	GPU : 计算normal
改变	    4.5930	GPU : 调整控制顶点
改变	    4.2160	GPU : tess
改变	    0.0430	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.5820	GPU : 计算Bezier曲面片采样点的值
改变	   11.2800	GPU : 计算Bezier曲面片采样点的值
改变	   11.6190	GPU : 计算控制顶点
改变	    4.3700	GPU : 计算normal
改变	    4.5830	GPU : 调整控制顶点
改变	    4.2290	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6040	GPU : 计算Bezier曲面片采样点的值
改变	   11.2750	GPU : 计算Bezier曲面片采样点的值
改变	   11.5350	GPU : 计算控制顶点
改变	    4.3690	GPU : 计算normal
改变	    4.6230	GPU : 调整控制顶点
改变	    4.2150	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6100	GPU : 计算Bezier曲面片采样点的值
改变	   11.2760	GPU : 计算Bezier曲面片采样点的值
改变	   11.5880	GPU : 计算控制顶点
改变	    4.3690	GPU : 计算normal
改变	    4.5810	GPU : 调整控制顶点
改变	    4.2170	GPU : tess
改变	    0.0330	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6010	GPU : 计算Bezier曲面片采样点的值
改变	   11.2770	GPU : 计算Bezier曲面片采样点的值
改变	   11.5090	GPU : 计算控制顶点
改变	    4.3770	GPU : 计算normal
改变	    4.6060	GPU : 调整控制顶点
改变	    4.2130	GPU : tess
改变	    0.0510	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6080	GPU : 计算Bezier曲面片采样点的值
改变	   11.2970	GPU : 计算Bezier曲面片采样点的值
改变	   11.5640	GPU : 计算控制顶点
改变	    4.3740	GPU : 计算normal
改变	    4.6790	GPU : 调整控制顶点
改变	    4.2410	GPU : tess
改变	    0.0600	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6120	GPU : 计算Bezier曲面片采样点的值
改变	   11.2860	GPU : 计算Bezier曲面片采样点的值
改变	   11.5300	GPU : 计算控制顶点
改变	    4.3660	GPU : 计算normal
改变	    4.5250	GPU : 调整控制顶点
改变	    4.2090	GPU : tess
改变	    0.0590	GPU : copy"""

data += """
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   38.4950	GPU : 计算Bezier曲面片采样点的值
改变	   13.5930	GPU : 计算Bezier曲面片采样点的值
改变	   13.9230	GPU : 计算控制顶点
改变	    5.2210	GPU : 计算normal
改变	    3.7380	GPU : 调整控制顶点
改变	    5.0570	GPU : tess
改变	    0.0570	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   36.1480	GPU : 计算Bezier曲面片采样点的值
改变	   12.7170	GPU : 计算Bezier曲面片采样点的值
改变	   13.0200	GPU : 计算控制顶点
改变	    4.8890	GPU : 计算normal
改变	    3.8800	GPU : 调整控制顶点
改变	    4.7280	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   35.7480	GPU : 计算Bezier曲面片采样点的值
改变	   12.7300	GPU : 计算Bezier曲面片采样点的值
改变	   13.0170	GPU : 计算控制顶点
改变	    4.9000	GPU : 计算normal
改变	    3.9150	GPU : 调整控制顶点
改变	    4.7130	GPU : tess
改变	    0.0350	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   32.6090	GPU : 计算Bezier曲面片采样点的值
改变	   11.6120	GPU : 计算Bezier曲面片采样点的值
改变	   11.8650	GPU : 计算控制顶点
改变	    4.4950	GPU : 计算normal
改变	    4.5510	GPU : 调整控制顶点
改变	    4.3380	GPU : tess
改变	    0.0430	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   32.5400	GPU : 计算Bezier曲面片采样点的值
改变	   11.6220	GPU : 计算Bezier曲面片采样点的值
改变	   11.9110	GPU : 计算控制顶点
改变	    4.4980	GPU : 计算normal
改变	    4.6180	GPU : 调整控制顶点
改变	    4.3050	GPU : tess
改变	    0.0570	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   32.0160	GPU : 计算Bezier曲面片采样点的值
改变	   11.3000	GPU : 计算Bezier曲面片采样点的值
改变	   11.6330	GPU : 计算控制顶点
改变	    4.3770	GPU : 计算normal
改变	    4.6120	GPU : 调整控制顶点
改变	    4.1950	GPU : tess
改变	    0.0320	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6000	GPU : 计算Bezier曲面片采样点的值
改变	   11.3030	GPU : 计算Bezier曲面片采样点的值
改变	   11.5140	GPU : 计算控制顶点
改变	    4.3710	GPU : 计算normal
改变	    4.6120	GPU : 调整控制顶点
改变	    4.1780	GPU : tess
改变	    0.0310	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6270	GPU : 计算Bezier曲面片采样点的值
改变	   11.2900	GPU : 计算Bezier曲面片采样点的值
改变	   11.5870	GPU : 计算控制顶点
改变	    4.3830	GPU : 计算normal
改变	    4.5180	GPU : 调整控制顶点
改变	    4.2190	GPU : tess
改变	    0.0590	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6150	GPU : 计算Bezier曲面片采样点的值
改变	   11.3070	GPU : 计算Bezier曲面片采样点的值
改变	   11.5330	GPU : 计算控制顶点
改变	    4.3680	GPU : 计算normal
改变	    4.6790	GPU : 调整控制顶点
改变	    4.2090	GPU : tess
改变	    0.0550	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.5890	GPU : 计算Bezier曲面片采样点的值
改变	   11.2890	GPU : 计算Bezier曲面片采样点的值
改变	   11.5980	GPU : 计算控制顶点
改变	    4.3830	GPU : 计算normal
改变	    4.5850	GPU : 调整控制顶点
改变	    4.2230	GPU : tess
改变	    0.0580	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6250	GPU : 计算Bezier曲面片采样点的值
改变	   11.2970	GPU : 计算Bezier曲面片采样点的值
改变	   11.5950	GPU : 计算控制顶点
改变	    4.3770	GPU : 计算normal
改变	    4.6170	GPU : 调整控制顶点
改变	    4.2120	GPU : tess
改变	    0.0440	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6300	GPU : 计算Bezier曲面片采样点的值
改变	   11.2830	GPU : 计算Bezier曲面片采样点的值
改变	   11.5570	GPU : 计算控制顶点
改变	    4.3660	GPU : 计算normal
改变	    4.5830	GPU : 调整控制顶点
改变	    4.2210	GPU : tess
改变	    0.0680	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6520	GPU : 计算Bezier曲面片采样点的值
改变	   11.3030	GPU : 计算Bezier曲面片采样点的值
改变	   11.4240	GPU : 计算控制顶点
改变	    4.3690	GPU : 计算normal
改变	    4.7090	GPU : 调整控制顶点
改变	    4.1970	GPU : tess
改变	    0.0300	GPU : copy
改变	1	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6150	GPU : 计算Bezier曲面片采样点的值
改变	   11.2790	GPU : 计算Bezier曲面片采样点的值
改变	   11.6150	GPU : 计算控制顶点
改变	    4.3670	GPU : 计算normal
改变	    4.5550	GPU : 调整控制顶点
改变	    4.1840	GPU : tess
改变	    0.0310	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5770	GPU : 计算Bezier曲面片采样点的值
改变	   11.2800	GPU : 计算Bezier曲面片采样点的值
改变	   11.4880	GPU : 计算控制顶点
改变	    4.3700	GPU : 计算normal
改变	    4.7450	GPU : 调整控制顶点
改变	    4.2030	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6460	GPU : 计算Bezier曲面片采样点的值
改变	   11.2960	GPU : 计算Bezier曲面片采样点的值
改变	   11.5260	GPU : 计算控制顶点
改变	    4.3700	GPU : 计算normal
改变	    4.6940	GPU : 调整控制顶点
改变	    4.2000	GPU : tess
改变	    0.0330	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6520	GPU : 计算Bezier曲面片采样点的值
改变	   11.3050	GPU : 计算Bezier曲面片采样点的值
改变	   11.4700	GPU : 计算控制顶点
改变	    4.3860	GPU : 计算normal
改变	    4.5370	GPU : 调整控制顶点
改变	    4.2380	GPU : tess
改变	    0.0550	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5510	GPU : 计算Bezier曲面片采样点的值
改变	   11.2750	GPU : 计算Bezier曲面片采样点的值
改变	   11.6420	GPU : 计算控制顶点
改变	    4.3710	GPU : 计算normal
改变	    4.5500	GPU : 调整控制顶点
改变	    4.2090	GPU : tess
改变	    0.0550	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6550	GPU : 计算Bezier曲面片采样点的值
改变	   11.2950	GPU : 计算Bezier曲面片采样点的值
改变	   11.5200	GPU : 计算控制顶点
改变	    4.3740	GPU : 计算normal
改变	    4.6900	GPU : 调整控制顶点
改变	    4.2030	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6260	GPU : 计算Bezier曲面片采样点的值
改变	   11.2810	GPU : 计算Bezier曲面片采样点的值
改变	   11.5810	GPU : 计算控制顶点
改变	    4.3720	GPU : 计算normal
改变	    4.6540	GPU : 调整控制顶点
改变	    4.2270	GPU : tess
改变	    0.0610	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6180	GPU : 计算Bezier曲面片采样点的值
改变	   11.2980	GPU : 计算Bezier曲面片采样点的值
改变	   11.6110	GPU : 计算控制顶点
改变	    4.3720	GPU : 计算normal
改变	    4.5280	GPU : 调整控制顶点
改变	    4.2240	GPU : tess
改变	    0.0570	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6340	GPU : 计算Bezier曲面片采样点的值
改变	   11.2790	GPU : 计算Bezier曲面片采样点的值
改变	   11.4480	GPU : 计算控制顶点
改变	    4.3720	GPU : 计算normal
改变	    4.7130	GPU : 调整控制顶点
改变	    4.2070	GPU : tess
改变	    0.0590	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6220	GPU : 计算Bezier曲面片采样点的值
改变	   11.2920	GPU : 计算Bezier曲面片采样点的值
改变	   11.5410	GPU : 计算控制顶点
改变	    4.3720	GPU : 计算normal
改变	    4.7450	GPU : 调整控制顶点
改变	    4.2260	GPU : tess
改变	    0.0620	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6100	GPU : 计算Bezier曲面片采样点的值
改变	   11.3100	GPU : 计算Bezier曲面片采样点的值
改变	   11.3680	GPU : 计算控制顶点
改变	    4.3730	GPU : 计算normal
改变	    4.6390	GPU : 调整控制顶点
改变	    4.2380	GPU : tess
改变	    0.0560	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6410	GPU : 计算Bezier曲面片采样点的值
改变	   11.2770	GPU : 计算Bezier曲面片采样点的值
改变	   11.5900	GPU : 计算控制顶点
改变	    4.3870	GPU : 计算normal
改变	    4.7270	GPU : 调整控制顶点
改变	    4.2180	GPU : tess
改变	    0.0560	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6490	GPU : 计算Bezier曲面片采样点的值
改变	   11.2890	GPU : 计算Bezier曲面片采样点的值
改变	   11.3940	GPU : 计算控制顶点
改变	    4.3850	GPU : 计算normal
改变	    4.6690	GPU : 调整控制顶点
改变	    4.2080	GPU : tess
改变	    0.0380	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6010	GPU : 计算Bezier曲面片采样点的值
改变	   11.3010	GPU : 计算Bezier曲面片采样点的值
改变	   11.5860	GPU : 计算控制顶点
改变	    4.3720	GPU : 计算normal
改变	    4.6670	GPU : 调整控制顶点
改变	    4.2180	GPU : tess
改变	    0.0570	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6490	GPU : 计算Bezier曲面片采样点的值
改变	   11.2940	GPU : 计算Bezier曲面片采样点的值
改变	   11.5070	GPU : 计算控制顶点
改变	    4.3670	GPU : 计算normal
改变	    4.6640	GPU : 调整控制顶点
改变	    4.2130	GPU : tess
改变	    0.0430	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6130	GPU : 计算Bezier曲面片采样点的值
改变	   11.3040	GPU : 计算Bezier曲面片采样点的值
改变	   11.5940	GPU : 计算控制顶点
改变	    4.3720	GPU : 计算normal
改变	    4.5730	GPU : 调整控制顶点
改变	    4.2290	GPU : tess
改变	    0.0580	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6280	GPU : 计算Bezier曲面片采样点的值
改变	   11.2910	GPU : 计算Bezier曲面片采样点的值
改变	   11.5880	GPU : 计算控制顶点
改变	    4.3750	GPU : 计算normal
改变	    4.5650	GPU : 调整控制顶点
改变	    4.2110	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6130	GPU : 计算Bezier曲面片采样点的值
改变	 -987.6970	GPU : 计算Bezier曲面片采样点的值
改变	   11.5280	GPU : 计算控制顶点
改变	    4.3690	GPU : 计算normal
改变	    4.5880	GPU : 调整控制顶点
改变	    4.2310	GPU : tess
改变	    0.0480	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.5760	GPU : 计算Bezier曲面片采样点的值
改变	   11.2880	GPU : 计算Bezier曲面片采样点的值
改变	   11.7020	GPU : 计算控制顶点
改变	    4.3770	GPU : 计算normal
改变	    4.6200	GPU : 调整控制顶点
改变	    4.2280	GPU : tess
改变	    0.0490	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6030	GPU : 计算Bezier曲面片采样点的值
改变	   11.2930	GPU : 计算Bezier曲面片采样点的值
改变	   11.5460	GPU : 计算控制顶点
改变	    4.3810	GPU : 计算normal
改变	    4.6650	GPU : 调整控制顶点
改变	    4.2000	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6450	GPU : 计算Bezier曲面片采样点的值
改变	   11.2850	GPU : 计算Bezier曲面片采样点的值
改变	   11.5150	GPU : 计算控制顶点
改变	    4.3710	GPU : 计算normal
改变	    4.5810	GPU : 调整控制顶点
改变	    4.2180	GPU : tess
改变	    0.0570	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6130	GPU : 计算Bezier曲面片采样点的值
改变	   11.2930	GPU : 计算Bezier曲面片采样点的值
改变	   11.5790	GPU : 计算控制顶点
改变	    4.3770	GPU : 计算normal
改变	    4.6490	GPU : 调整控制顶点
改变	    4.2050	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6140	GPU : 计算Bezier曲面片采样点的值
改变	   11.2910	GPU : 计算Bezier曲面片采样点的值
改变	   11.4340	GPU : 计算控制顶点
改变	    4.3690	GPU : 计算normal
改变	    4.6180	GPU : 调整控制顶点
改变	    4.2060	GPU : tess
改变	    0.0570	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6560	GPU : 计算Bezier曲面片采样点的值
改变	   11.3060	GPU : 计算Bezier曲面片采样点的值
改变	   11.5080	GPU : 计算控制顶点
改变	    4.3800	GPU : 计算normal
改变	    4.6180	GPU : 调整控制顶点
改变	    4.2370	GPU : tess
改变	    0.0580	GPU : copy
改变	0	CPU : 改变控制顶点
改变	0	GPU : 将新的控制顶点传入显存
改变	   31.6170	GPU : 计算Bezier曲面片采样点的值
改变	   11.2870	GPU : 计算Bezier曲面片采样点的值
改变	   11.6070	GPU : 计算控制顶点
改变	    4.3760	GPU : 计算normal
改变	    4.6060	GPU : 调整控制顶点
改变	    4.2300	GPU : tess
改变	    0.0420	GPU : copy
改变	0	CPU : 改变控制顶点
改变	1	GPU : 将新的控制顶点传入显存
改变	   31.6150	GPU : 计算Bezier曲面片采样点的值
改变	   11.2940	GPU : 计算Bezier曲面片采样点的值
改变	   11.5170	GPU : 计算控制顶点
改变	    4.3760	GPU : 计算normal
改变	    4.5530	GPU : 调整控制顶点
改变	    4.2230	GPU : tess
改变	    0.0450	GPU : copy"""


data2 = []
for l in zip(*[iter(data.split('\n'))] * 9):
    data2.append(l)
print(len(data2))
res = [0] * (len(data2[0]))
for l in data2:
    # print(l)
    if float(l[3].split()[1]) < 0:
        continue

    if float(l[2].split()[1]) < 0:
        continue
    for i, s in enumerate(l):
        # print(i, s)
        tokens = s.split()
        f = float(tokens[1])
        if f < 0:
            print(s)
        res[i] += f

for i, t in enumerate(res):
    tokens = data2[0][i].split()
    tokens[1] = '%10.3f' % (t / len(data2))
    print(' '.join(tokens))

print('deformation total:', sum(res[1:]) / 101)

data = """
---deform shader run time: r76.884992 ms, c 76.884992 ms---
copy controlto gpu 0.00512 ms
---deform shader run time: r75.310592 ms, c 73.736192 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r73.1815146667 ms, c 68.92336 ms---
copy controlto gpu 0.00304 ms
---deform shader run time: r71.77344 ms, c 67.549216 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r70.940672 ms, c 67.6096 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r70.3641546667 ms, c 67.481568 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r69.9728411429 ms, c 67.62496 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r69.670524 ms, c 67.554304 ms---
copy controlto gpu 0.00512 ms
---deform shader run time: r69.437888 ms, c 67.5768 ms---
copy controlto gpu 0.003072 ms
---deform shader run time: r69.2410272 ms, c 67.46928 ms---
copy controlto gpu 0.01024 ms
---deform shader run time: r69.0924392727 ms, c 67.60656 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.9588 ms, c 67.488768 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.8394953846 ms, c 67.40784 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.7582262857 ms, c 67.701728 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r68.6672469333 ms, c 67.393536 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.605432 ms, c 67.678208 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.545408 ms, c 67.585024 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.4839751111 ms, c 67.439616 ms---
copy controlto gpu 0.00512 ms
---deform shader run time: r68.4353162105 ms, c 67.559456 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.3856336 ms, c 67.441664 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.3430704762 ms, c 67.491808 ms---
copy controlto gpu 0.00512 ms
---deform shader run time: r68.3050763636 ms, c 67.5072 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.2701648696 ms, c 67.502112 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r68.2411053333 ms, c 67.572736 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.20965888 ms, c 67.454944 ms---
copy controlto gpu 0.01232 ms
---deform shader run time: r68.1897698462 ms, c 67.692544 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r68.1670305185 ms, c 67.575808 ms---
copy controlto gpu 0.003104 ms
---deform shader run time: r68.1442331429 ms, c 67.528704 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.1252678621 ms, c 67.59424 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.1072928 ms, c 67.586016 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r68.0924273548 ms, c 67.646464 ms---
copy controlto gpu 0.003072 ms
---deform shader run time: r68.078683 ms, c 67.652608 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r68.0646855758 ms, c 67.616768 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.0534089412 ms, c 67.68128 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r68.0349065143 ms, c 67.405824 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.022352 ms, c 67.582944 ms---
copy controlto gpu 0.003072 ms
---deform shader run time: r68.0115848649 ms, c 67.623968 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.9977465263 ms, c 67.485728 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.9846687179 ms, c 67.487712 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.9757776 ms, c 67.629024 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.9648234146 ms, c 67.526656 ms---
copy controlto gpu 0.005088 ms
---deform shader run time: r67.9526354286 ms, c 67.452928 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.9429186977 ms, c 67.534816 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.9335047273 ms, c 67.528704 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.9268992 ms, c 67.636256 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.9175304348 ms, c 67.495936 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.9106076596 ms, c 67.59216 ms---
copy controlto gpu 0.00512 ms
---deform shader run time: r67.9005606667 ms, c 67.428352 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.8934733061 ms, c 67.55328 ms---
copy controlto gpu 0.004128 ms
---deform shader run time: r67.88920896 ms, c 67.680256 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.8831033725 ms, c 67.577824 ms---
copy controlto gpu 0.006144 ms
---deform shader run time: r67.8795969231 ms, c 67.700768 ms---
copy controlto gpu 0.005152 ms
---deform shader run time: r67.8737110943 ms, c 67.567648 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.8657285926 ms, c 67.442656 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.8586693818 ms, c 67.477472 ms---
copy controlto gpu 0.003104 ms
---deform shader run time: r67.8552822857 ms, c 67.668992 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.8509726316 ms, c 67.609632 ms---
copy controlto gpu 0.004128 ms
---deform shader run time: r67.8457688276 ms, c 67.549152 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.837687322 ms, c 67.36896 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.8338858667 ms, c 67.6096 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.8287989508 ms, c 67.523584 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.8237434839 ms, c 67.51536 ms---
Xlib: sequence lost (0x102ab > 0x2ac) in reply type 0x23!
copy controlto gpu 0.005152 ms
---deform shader run time: r67.819808 ms, c 67.575808 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.8144755 ms, c 67.478528 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.8102050462 ms, c 67.536896 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.8090739394 ms, c 67.735552 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.8047207164 ms, c 67.517408 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.799336 ms, c 67.43856 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.7960811594 ms, c 67.574752 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.7911789714 ms, c 67.452928 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.7862557746 ms, c 67.441632 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.7826644444 ms, c 67.52768 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.7795783014 ms, c 67.557376 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r67.7762157838 ms, c 67.530752 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r67.77344768 ms, c 67.568608 ms---
copy controlto gpu 0.00512 ms
copy controlto gpu 0.004096 ms
---deform shader run time: r67.9548568421 ms, c 81.560544 ms---
copy controlto gpu 0.00512 ms
---deform shader run time: r68.1328577662 ms, c 81.660928 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.2239803077 ms, c 75.240416 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.2942602532 ms, c 73.776096 ms---
copy controlto gpu 0.004064 ms
---deform shader run time: r68.2840256 ms, c 67.475488 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.2754587654 ms, c 67.590112 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.2635547317 ms, c 67.299328 ms---
copy controlto gpu 0.004032 ms
---deform shader run time: r68.2527394699 ms, c 67.365888 ms---
copy controlto gpu 0.004064 ms
copy controlto gpu 0.004096 ms
---deform shader run time: r68.2455459048 ms, c 67.64848 ms---
copy controlto gpu 0.004096 ms
---deform shader run time: r68.2380280471 ms, c 67.606528 ms---
"""
data2 = []
for l in data.split('\n'):
    if l.startswith("copy"):
        data2.append(l)
total = 0
for d in data2:
    total += float(d.split()[3])
print('copy', total / len(data2))


